Repository: yshialexandra/Optimizing_LLM_Chinese_Translation_through_Syntactic_Feature_Extraction_and_Representation_Editing
Catalog: yshibachlorpaper/Yiyan_tmx/E23C.tmx
Source language: en_us
Languages: zh_cn

source: How to Buy and Arrange Flowers Like an Expert
zh_cn: 如何像专家一样买花和插花

source: Cut flowers can be purchased in a multitude of places, such as gas stations, grocery stores, roadside stalls as well as the usual florist shops.
zh_cn: 鲜花可以在许多地方买到，例如加油站、杂货店、路边摊以及通常的花店。

source: Although some of the cheapest may be found in grocery stores or have the convenience of being sold at gas stations, if these are sold in pre-prepared bouquets there is more probability that these flowers were cut and prepared a while ago and that they will not be at their freshest.
zh_cn: 虽然可以在杂货店或有便利店的加油站可以买到最便宜的花，如果买到的是预制好的花束，那么鲜花从采摘到购买已经过去了很长时间了，可能不是很新鲜。

source: Examine the flowers.
zh_cn: 检查鲜花

source: Look at the stems.
zh_cn: 首先看鲜花的茎。

source: If the stems are unbroken and have clean, healthy looking ends with a strong colour, they are still at their peak, but if the ends look faded, slimy or mushy, then they are not healthy specimens.
zh_cn: 如果茎没有破损、比较清洁、在尾部的颜色看起来比较浓郁，那么这朵鲜花还在它的最佳状态。但是，如果茎的尾部已经褪色、呈现黏糊状，那么鲜花则不是很健康。

source: Bacteria in the water can damage the stems, and will travel up them, weakening and damaging the leaves and heads of the flowers and inhibiting the ability to take up water.
zh_cn: 在水中的细菌会损坏茎，细菌还会顺着茎移动，损坏花的叶子和顶部的花朵，并且会抑制花的吸水能力。

source: Look at the water in the container.
zh_cn: 检查花瓶中的水

source: Is it fresh and clear in appearance?
zh_cn: 花瓶中的水看起来干净、清澈吗？

source: If the water is murky and smells stagnant, it is full of bacteria which attack and starve the flowers of nutrients and promote their decay.
zh_cn: 如果水看起来浑浊、黑乎乎，并且有臭味，说明水里充满了细菌，细菌会侵蚀花，使其缺乏必需的营养，并且加速了花衰老。

source: Leaves submerged or floating in the water will also encourage bacterial growth.
zh_cn: 水中及浮在水面上的叶子也会促进细菌的生长。

source: Check the leaves.
zh_cn: 检查叶子

source: Leaves should have a strong colour and should not drooping from the stems.
zh_cn: 叶子应该有浓郁的颜色，而且不应该从茎上脱落。

source: Any discolouration¡ªsuch as turning brown or yellow, or becoming speckled¡ªmay indicate infection, and leaves with holes or bits missing may have succumbed to attack from insects.
zh_cn: 任何褪色，例如变黄或变棕，有着有斑点，都有可能感染细菌。若叶子有小洞或者脱落，则说明花很有可能会死于虫害。

source: A pest infestation will weaken the flowers and speed up their decline as well as affecting their appearance.
zh_cn: 感染害虫会加速花朵的衰老，并且会影响它们的样子。

source: Check the flower heads.
zh_cn: 检查花朵

source: The petals should have a defined colour and be soft, but also dry and firm to touch.
zh_cn: 花朵应该是正常的颜色，并且柔软，而且摸起来干燥、结实。

source: Avoid buying if the petals are moist, fading in colour, turning brown or dropping off.
zh_cn: 不要购买花瓣潮湿、褪色、变棕、脱落的鲜花。

source: Choose flowers with buds that are just about to open; they will unfurl and flower in the vase, and will continue to look their best for longer, compared to a bunch that is already in full bloom.
zh_cn: 可以买花蕾刚刚绽放的花朵，它们会在花瓶中开花，和在购买时完全开花的比起来，它们可以更长时间的保持最佳状态。

source: Arranging Your Flowers.
zh_cn: 如何插花：

source: Water And Feed.
zh_cn: 水和营养

source: First, fill the vase with cool or lukewarm water with added flower food.
zh_cn: 首先，在花瓶中加入冷水或温水，并加入植物营养液。

source: Most foods contain an anti-bacterial agent, but otherwise a small amount of bleach, lemon juice or vinegar can be added and will create a slight increase in acidity, which will inhibit bacterial growth.
zh_cn: 大多数的营养液不仅包含抗菌药剂，还加入了少量漂白剂、柠檬汁或醋，这可以提升水的酸性，从而抑制细菌生长。

source: Cutting the stems.
zh_cn: 剪切花的茎

source: If possible avoid using scissors to cut the stems.
zh_cn: 如果可能的话，避免使用剪刀剪切花茎。

source: Often these are not sharp enough, and the action of the blades can crush the stems. Ideally use pruning shears or a floral knife.
zh_cn: 通常剪刀不够锋利，刀刃可能会压碎茎的剪切部位，所以最好使用修枝剪或花艺小刀。

source: Cut at a 45 degree angle to maximise the openings to allow water absorption.
zh_cn: 采用45度角剪切可以使切面最大化，从而更有利于水分的吸收。

source: Remove any leaves that will fall below the waterline.
zh_cn: 切掉所有可能落入水中以及泡在水中的叶子，防止腐烂。

source: Searing the stems.
zh_cn: 浸烫花的茎

source: Searing the ends of the stems will force the air out of the stems, seal the cut, and preserve mositure.
zh_cn: 浸烫花茎的底部可以排除茎中的空气、梗塞切口、防止花枝组织液外溢。

source: Place about 10% of the end of the stems in boiling hot water for about 30 seconds for soft stems or until the water becomes lukewarm for tougher stems.
zh_cn: 对于较软的茎，可以将大约10%的茎尾部放入沸水中30秒，对于结实的茎，可以入沸水中直到水变温。

source: Be careful to protect the heads of the flowers from the steam by wrapping them loosely in brown paper.
zh_cn: 注意保护顶部的花朵，可以使用松的棕色纸包住它们。

source: When ready, cut the ends again before arranging.
zh_cn: 当准备好时，在插花前再次切掉茎的底部。

source: Display.
zh_cn: 摆放鲜花

source: For the display, consider the type of presentation you would like to create.
zh_cn: 在摆放鲜花之前，你首先需要考虑想要创造哪种类型的表现效果。

source: Do you want something dramatic, or something cheerful and colourful?
zh_cn: 你需要生动的、快乐的、还是鲜艳的效果？

source: A bouquet that promotes calm, or a dazzling display of riotous colour?
zh_cn: 一束花可以使人平静，也可以使人感到眼花缭乱、色彩缤纷。

source: The two main aspects of flower arranging are colour and shape.
zh_cn: 插花的两个主要方面是花的颜色和形状。

source: Colour.
zh_cn: 颜色

source: For most displays, stick to between one to three hues, unless you are intending on a wild, carefree display.
zh_cn: 对于绝大多数情况，需要坚持仅有1至3种色调的原则，除非你打算创造一种狂野、无拘束的展示效果。

source: For more visual impact with a sense of order, arrange different flowers of the same colour together.
zh_cn: 为了增强视觉冲击力，可以将同样颜色的多种花卉组合在一起。

source: To create a good back drop that will enhance the colours, add foliage to the display: vibrant or deep green will enhance the tones of the flowers.
zh_cn: 想要更好的体现出花卉的颜色，需要创造好的背景，加入有活力、深绿的叶子植物可以达到很好的效果。

source: Shape.
zh_cn: 形状

source: The best way to create shape is to use a criss-cross grid in the vase, which maintains the shape and structure of the display.
zh_cn: 构造形状最好的方法是在花瓶中放入一个十字网格，它可以保持展示的形状和整体结构。

source: Add foliage first, and then the flowers.
zh_cn: 首先加入叶子植物，在加入花卉。

source: For large-stemmed flowers, put one per square, and for small dedicate flowers, a bunch in each will ensure a well-filled arrangement.
zh_cn: 对于较大的有茎花，可以让每朵花差入一个方格中，对于较小的花，可以一束放入一个方格中，这样可以确保组合形态良好。

source: A simple but impacting display uses a narrow-necked vase or container with a single stemmed flower.
zh_cn: 一个简单美观的展示方法是将一朵花单独插入一个细颈瓶中。

source: Stability.
zh_cn: 稳定

source: To maintain the structure of the display, use clear rubber bands to hold groups of stems together.
zh_cn: 为了维护插花的结构，可以使用透明的橡胶带绑住一组花的茎。
